https://www.perplexity.ai/search/a582a441-1968-40e0-9be5-bde48bf8f663

In [3]:
import pandas as pd
import numpy as np


df = pd.DataFrame(np.arange(9).reshape((3, 3)),
            index=['a', 'b', 'c'],
            columns=['台北', '台中', '高雄'])
df

   台北  台中  高雄
a   0   1   2
b   3   4   5
c   6   7   8

In [5]:
df1 = df.reindex(index=['b','a','c'])
df1

   台北  台中  高雄
b   3   4   5
a   0   1   2
c   6   7   8

In [8]:
df2 = df1.reindex(columns=['台中','台北'])
df2

   台中  台北
b   4   3
a   1   0
c   7   6

In [9]:
df3 = pd.DataFrame(np.arange(16).reshape(4, 4),
                    index=['台北','台中', '台南', '高雄'],
                    columns=['one', 'two', 'three', 'four'])
df3

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [11]:
df3.drop(index=['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15